#include <iostream>

using namespace std;

int main(int argc, char *argv[])
{
   /*
    * https://itproger.com/course/cpp/2
    * 
    * Создайте приложение, которое выведет на экран такие 
    * слова, как: "Гречка", "Котлеты", "Каша", "Молоко" и 
    * "Сметана". Каждое слово необходимо выводить с новой 
    * строки. 
    */
    
    system("clear");
    cout << "Домашнее задание № 2.2\n" << endl;

    cout << "Гечка" << endl;
    cout << "Котлеты" << endl;
    cout << "каша" << endl;
    cout << "Молоко" << endl;
    cout << "Сметана" << endl;
   
    cout << endl;

    return 0;
}